# 1. Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример:

# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

import unique as un

my_list = [1, 2, 3, 5, 1, 5, 3, 10]
print(f'{my_list} => {un.get_unic(my_list)}')
