# Задача №17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6
# Примечание: Пользователь может вводить значения
# списка или список задан изначально.

data = [1, 1, 2, 0, -1, 3, 4, 4]
print(f'Задача №17. Решение в группах\nДан список чисел. Определите, сколько в нем\nвстречается различных чисел.\nПримечание: Пользователь может вводить значения\nсписка или список задан изначально.')
print(f'Input: {data} \nOutput: {len(set(data))}')